import React from "react";
import { useLocation } from "react-router-dom";

const AboutSection: React.FC = () => {
  const location = useLocation();

  const text = `אנחנו תמר ויעל, מעצבות חללים פנימיים ליזמים, עסקים ובתים מורכבים.
זכינו להגשים כבר עשרות חלומות בגוונים ובמימדים שונים.
ועדיין מתרגשות כל פעם מחדש
לפגוש לקוחות מאושרים 
שהחלל שלהם שילש את שוויו על ידי עיצוב פנים וסטיילינג גאוני, 
ואנחנו נושאות באשמה:)

כשאנחנו מתחילות לשרטט, אנחנו יחד, כדי שחלילה לא נחמיץ פרט עליך:
את הצרכים וההרגלים את היכולות והמטרות
והכי- את המחיר היקר ששילמת על הנדל"ן הישראלי.
פתאום במתנת שמים נדירה, השרטוט קם לו
ונולד עיצוב על זמני שישאר רלוונטי, אפקטיבי ונוח לאורך שנים.

בדיוק עבורכם, אנחנו יחד, כדי להגיע להישגים כפולים.
מחכות לתת גם לכם- 
תמר ויעל.
`;

  const isAboutPage = location.pathname.endsWith("/AboutSection");

  return (
    <div className="main-container">
      <div className="about">
        <section id="about" className="about-section">
          <div className="about-text">
            <h2 className="mixed-text ">נעים מאד</h2>
            <h2 className="mixed-text ">וברכות על הצעד!<br /><br /></h2>
            <pre className="about-text">{text}</pre>
          </div>
        </section>

        {isAboutPage && (
          <section className="beliefs-section">
            <div className="belief-card">
              <h3>🤝 אנחנו מאמינות באנושיות</h3>
              <p>
                הידע שצברנו, הניסיון מעשרות עיצובים – כולם כפופים למאווים שלכם.<br />
                כי בסוף יום, אנחנו נחזור למשרד, והשטח יישאר שלכם.<br />
                לאורך התהליך נלך שלובות זרוע עם הוויז'ן שלכם לעבר המטרות שתרצו,<br />
                וגם כשנפתיע – זה יהיה בדיוק בגירסה שתאהבו.
              </p>
            </div>

            <div className="belief-card">
              <h3>🧠 אנחנו מאמינות בחשיבה</h3>
              <p>
                פונקציונאליות, אסתטיקה, נוחות וארגונומיה – לא רק מילים שכיף לגלגל על הלשון.<br />
                זה מה שיתן לכם כ-2.6 מ"ר נוספים בכל חדר!<br />
                נתחיל בחשיבה נפרדת, נתקדם לחשיבה משותפת,<br />
                עד שנפרוץ דרך וייצר יופי חד פעמי שתאהבו.
              </p>
            </div>

            <div className="belief-card">
              <h3>📞 אנחנו מאמינות בזמינות</h3>
              <p>
                כל מקצוע צריך זמינות – אבל שפועלי הבנייה יחכו שמעצב יתעורר?<br />
                מהפנייה הראשונה – תענו בזמינות אכפתית.<br />
                מהשרטוטים, דרך רכישת האבזור ועד לרהיטים בשטח –<br />
                אנחנו איתכם. שלא תישאר שאלה.<br />
                <strong>נסו את הזמינות שלנו!</strong>
              </p>
            </div>
          </section>
        )}
      </div>
    </div>
  );
};

export default AboutSection;
